[
    {
        "file": "blog/mudmonster.png",
        "title": "MudMonster",
        "date": "5/21/2020",
        "entry": "This was an attempt at making some art every week, which is proving to be increasingly difficult as the term nears it's close. This image came together rather quickly. I wanted to mostly work on the texture, which I feel came through very well with the mud. Also their one hand waving was something that I was able to draw pretty quickly. I'm glad I am noticing some improvement with hands at least, they used to be so intimidating to draw! Hands are also very expressive, which makes my ability to draw them that much more important! I still need to work on my grassy texture, on the right side of the image, I feel that it turned out best, however I think that it looks a little inconsistant across the background, as I continued to expand across the background. My shadows look alright, they will continue to improve, as I continue to practice and thinking about lighting in other pieces. -TEN "
        },
    {
        "file": "blog/furry.png",
        "title": "Is This How You Furry?",
        "date": "5/14/2020",
        "entry": "This image stuck in my brain shortly before I started. Overall, I think this turned out very well. My work with figures has improved greatly and I'm finding that hands are not nearly as hard to draw as they once were. Usually when I draw I am using a pen or pencil, so when the opportunity to add color to a drawing presents itself, I am finding that its taking me a while to produce color palletes that I find cohesive, though once found I am satisfied with the results. Mainly what I don't like about this piece is how I placed some of the highlight colors. I find that the areas I don't like most are the upper left arm of the figure, and the stomache. The lighting choices I made in those areas look wack to me. however, I feel like I did well with the highlights of the figure's breasts, and legs which looks pretty clean. Unfortunately I also accidenatally lost a bunch of progress while doing this. I am pretty sure most of what got lost was the highlight colors, which explains why the highligts aren't as meticulously placed as the shadows. I kind of wanted to include some background furniture in the style of those wall's meeting corner in the background, in that it would just be the outlines of the furniture but that pop psycadelic background would still be the entirety of the colors. Lastly I feel like this was good practice for me. I can see where I have been improving and where I have more work to do. I feel I could get this picture to look better if I put more time into it, but on the other hand, my hand hurts, and I've been at this for a while. I would probably improve more if I put that effort into another piece. I'm also looking forward to practicing with that straight line tool for that furniture idea. Unfortunately, I believe that the loss of progress I made midway through the project generally hindered the outcome of this piece. -TEN"
        },
    {
    "file": "blog/erckle.jpg",
    "title": "Erckle",
    "date": "2/xx/2020",
    "entry": "I'll think of something later. *DOESN'T THINK OF ANYTHING LATER* -TEN"
        }
]